Revit 2024 API
ParameterTypeId.LegendComponent Property
 "Component Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LegendComponent { get; }
Visual Basic
Public Shared ReadOnly Property LegendComponent As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LegendComponent {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace